[
    {
        "id": "myth-1",
        "title": "Masturbation causes weakness",
        "myth": "Masturbation leads to physical weakness, memory loss, and poor eyesight.",
        "fact": "Masturbation is a normal, safe sexual activity. There is no medical evidence linking it to weakness, memory loss, or vision problems.",
        "explanation": "This myth is often rooted in stigma, shame, and misinformation. Masturbation does not deplete vital nutrients or damage the body. In fact, for many people it can help with stress relief, sleep, and learning about their own body.",
        "culturalContext": "In many communities, masturbation is treated as taboo, so people may feel guilt or fear after normal sexual behavior. This can increase anxiety and make the myth feel “true,” even though it’s not medically accurate.",
        "riskFactors": "Shame-based messaging, misinformation from peers/social media, anxiety symptoms misattributed to masturbation, obsessive worry about semen/energy loss, and lack of reliable sex education.",
        "references": [
            "WHO Sexual Health Guidelines",
            "Journal of Psychiatry, 2013"
        ],
        "category": "body-literacy",
        "tags": [
            "masturbation",
            "myths",
            "dhat"
        ]
    },
    {
        "id": "myth-2",
        "title": "You can't get pregnant the first time",
        "myth": "A person cannot get pregnant during their first sexual intercourse.",
        "fact": "Pregnancy can occur any time unprotected vaginal intercourse happens, including the very first time.",
        "explanation": "Ovulation doesn't depend on prior sexual experience. If an egg is available and sperm is present, fertilization can happen — regardless of whether it's the first time or the hundredth.",
        "culturalContext": "When people receive limited or inaccurate sex education, “first time” myths can feel believable and lead to contraception being delayed or skipped — which increases the risk of unplanned pregnancy.",
        "riskFactors": "Unprotected vaginal intercourse, incorrect assumptions about ovulation/fertile window, inconsistent contraception use, lack of access to accurate information, and pressure or rushed decision-making during intimacy.",
        "references": [
            "FOGSI Guidelines on Contraception",
            "NHS UK - Contraception Facts"
        ],
        "category": "contraception",
        "tags": [
            "pregnancy",
            "first-time",
            "contraception"
        ]
    },
    {
        "id": "myth-3",
        "title": "Only men enjoy sex",
        "myth": "Sexual pleasure is primarily a male experience; women don't or shouldn't enjoy sex.",
        "fact": "Sexual pleasure is a normal human experience regardless of gender. Women have as much physiological capacity for pleasure as men.",
        "explanation": "The clitoris has thousands of nerve endings and its primary role is pleasure. Research shows sexual satisfaction supports wellbeing, relationship quality, and emotional closeness for many people.",
        "culturalContext": "In many cultures, female sexuality is suppressed or treated as shameful. This can reduce communication, increase dissatisfaction, and make people ignore pain, discomfort, or unmet needs.",
        "riskFactors": "Stigma around female desire, lack of body literacy, unequal power dynamics, limited consent/communication skills, and prioritizing performance over comfort and connection.",
        "references": [
            "Journal of Sexual Medicine",
            "The Kinsey Institute"
        ],
        "category": "body-literacy",
        "tags": [
            "female-pleasure",
            "gender",
            "myths"
        ]
    },
    {
        "id": "myth-4",
        "title": "STIs only happen to 'promiscuous' people",
        "myth": "Sexually transmitted infections only affect people who have many sexual partners.",
        "fact": "Anyone who is sexually active can contract an STI, regardless of the number of partners. Even one unprotected encounter carries risk.",
        "explanation": "STIs are caused by bacteria, viruses, or parasites — they don’t reflect morality. Many STIs (like HPV and herpes) are common, and some can spread even when symptoms are not visible.",
        "culturalContext": "Stigma can stop people from getting tested, talking to partners, or seeking treatment early. Normalizing testing and prevention reduces harm and protects relationships.",
        "riskFactors": "Unprotected sex, not testing with new partners, multiple partners without barrier protection, untreated infections, relying on symptoms alone, and misinformation about transmission (including oral/skin-to-skin spread).",
        "references": [
            "NACO - STI Guidelines",
            "WHO Fact Sheet on STIs"
        ],
        "category": "sexual-health",
        "tags": [
            "STI",
            "testing",
            "stigma"
        ]
    },
    {
        "id": "myth-5",
        "title": "Condoms reduce pleasure significantly",
        "myth": "Using condoms makes sex significantly less pleasurable and isn't worth it.",
        "fact": "Modern condoms are designed to be thin and comfortable. Any minimal reduction in sensation is far outweighed by protection against STIs and unplanned pregnancy.",
        "explanation": "Proper sizing, lubrication, and options like ultra-thin or textured condoms improve comfort. For many couples, reduced anxiety about pregnancy/STIs can improve overall enjoyment.",
        "culturalContext": "Some people avoid condoms due to embarrassment, myths about pleasure, or pressure from a partner. Comfort often improves with correct use and a supportive conversation.",
        "riskFactors": "Incorrect size/fit, no lubrication (more friction), incorrect use (late application/early removal), expired or damaged condoms, and using oil-based products with latex condoms.",
        "references": [
            "Journal of Medical Research",
            "Planned Parenthood"
        ],
        "category": "sexual-health",
        "tags": [
            "condoms",
            "contraception",
            "pleasure"
        ]
    },
    {
        "id": "myth-6",
        "title": "LGBTQIA+ identities are a Western influence",
        "myth": "Homosexuality and gender diversity are imported from Western culture and are unnatural.",
        "fact": "Same-sex relationships and gender diversity have been documented across many societies and historical periods, including in South Asian art, literature, and community traditions.",
        "explanation": "Historical records and cultural artifacts show diverse expressions of sexuality and gender. Also, many laws used to criminalize same-sex relationships were introduced during colonial periods. In 2018, the Supreme Court struck down parts of Section 377 that criminalized consensual same-sex relationships between adults.",
        "culturalContext": "Gender and sexual diversity have existed locally for a long time, but stigma and misinformation can erase that history. Respect, safety, and equal rights support healthier communities for everyone.",
        "riskFactors": "Stigma and discrimination, family/social pressure, lack of safe support systems, misinformation about mental health, and fear of seeking healthcare or counseling.",
        "references": [
            "Navtej Singh Johar case (2018) - Section 377 judgement",
            "Ruth Vanita - Same-Sex Love in South Asia"
        ],
        "category": "lgbtqia",
        "tags": [
            "LGBTQIA",
            "history",
            "section-377"
        ]
    },
    {
        "id": "myth-7",
        "title": "Talking about sex with your partner is awkward and unnecessary",
        "myth": "Good partners should intuitively know what the other person wants without discussing it.",
        "fact": "Open communication about desires, boundaries, and comfort is one of the strongest predictors of sexual satisfaction and healthy relationships.",
        "explanation": "Preferences vary between people and change over time. Clear, respectful communication helps partners align expectations, improve consent, and reduce misunderstandings.",
        "culturalContext": "Many couples grow up without healthy examples of intimacy communication, so conversations can feel uncomfortable at first. Starting small and using respectful language builds trust.",
        "riskFactors": "Fear of judgment, poor conflict-resolution skills, unequal power dynamics, lack of consent education, and avoiding conversations after negative experiences or pain.",
        "references": [
            "Journal of Marriage and Family Therapy",
            "Gottman Institute Research"
        ],
        "category": "relationships",
        "tags": [
            "communication",
            "couples",
            "intimacy"
        ]
    },
    {
        "id": "myth-8",
        "title": "Emergency contraception is an 'abortion pill'",
        "myth": "The morning-after pill (emergency contraception) is the same as an abortion pill and terminates pregnancy.",
        "fact": "Emergency contraception helps prevent pregnancy from occurring — it does not terminate an existing pregnancy.",
        "explanation": "Emergency contraceptive pills work mainly by delaying ovulation and may prevent fertilization. They do not end an established pregnancy and are different from medical abortion medications.",
        "culturalContext": "People may avoid emergency contraception due to fear, moral stigma, or misinformation. Accurate information helps people make timely decisions after contraception failure or unprotected sex.",
        "riskFactors": "Delay in taking the pill (less effective over time), repeated reliance instead of regular contraception, unprotected intercourse during fertile window, vomiting soon after taking (may reduce effectiveness), and lack of follow-up when a period is late.",
        "references": [
            "FOGSI - Emergency Contraception Guidelines",
            "WHO - Emergency Contraception Fact Sheet"
        ],
        "category": "contraception",
        "tags": [
            "emergency-contraception",
            "i-pill",
            "pregnancy"
        ]
    },
    {
        "id": "myth-9",
        "title": "Size determines sexual satisfaction",
        "myth": "Genital size is the primary determinant of sexual pleasure and performance.",
        "fact": "Sexual satisfaction depends more on communication, comfort, technique, emotional connection, and mutual respect than on anatomy measurements.",
        "explanation": "Research generally finds weak or no correlation between genital size and partner satisfaction. Foreplay, trust, and responsiveness are stronger predictors of a positive experience.",
        "culturalContext": "Body-image pressure and misleading marketing can create unnecessary anxiety. Confidence and skills (like communication and consent) matter far more than comparison standards.",
        "riskFactors": "Body dysmorphia or anxiety, exposure to unrealistic pornography, pressure to “perform,” scams or unsafe “enhancement” products, and avoidance of intimacy due to fear of judgment.",
        "references": [
            "British Journal of Urology International",
            "Journal of Sexual Medicine"
        ],
        "category": "body-literacy",
        "tags": [
            "body-image",
            "size-anxiety",
            "myths"
        ]
    },
    {
        "id": "myth-10",
        "title": "Married people can't be sexually assaulted by their spouse",
        "myth": "Marriage implies permanent consent — a spouse cannot refuse sexual activity.",
        "fact": "Consent is required for every sexual interaction, regardless of marital status. Forced sex is a violation of bodily autonomy.",
        "explanation": "Consent must be freely given, informed, and reversible at any time. Forced sex within marriage can cause the same physical and psychological harm as assault outside marriage.",
        "culturalContext": "Some people are taught that marriage removes the need for consent. Healthy relationships depend on mutual respect, safety, and the ability to say no without fear.",
        "riskFactors": "Coercion or intimidation, financial/social dependency, lack of awareness about consent, normalized control or abuse, and limited access to confidential support services.",
        "references": [
            "Karnataka High Court - RIT Foundation case, 2022",
            "National Commission for Women"
        ],
        "category": "consent",
        "tags": [
            "consent",
            "marital-rape",
            "rights"
        ]
    }
]